<!DOCTYPE html>
<html> 
<head>
	<link rel="stylesheet" type="text/css" href="CSS/stylesheet.css">
	<title>P&aacute;gina de vida</title>
</head>
<body>

<div id="page">

	<div class="infoCard">
		<table>
			<tr>
				<td rowspan="6"><img src="images/noImage.jpg" width="150" height="150"></td>
				<td><b>&Aacute;ngel Alberto Villa Zavaleta</b></td>
			</tr>
			<tr><td></td></tr>
			<tr><td>Estudiante en el Tecnol&oacute;gico de Monterrey</td></tr>
			<tr><td>Andador Tacana #6, Col. Lomas de Casa Blanca</td></tr>
			<tr><td><a href="mailto:angel.alberto.villa.zavaleta@gmail.com">angel.alberto.villa.zavaleta@gmail.com</a></td></tr>
			<tr><td>271-124-3531</td></tr>
		</table>
	</div>

	<div class="marco">	

		<h1>Formaci&oacute;n acad&eacute;mica</h1>

		<hr />

		<p>Como no considero reelevante la educaci&oacute;n b&aacute;sica en mi formaci&oacute;n acad&eacute;mica en mi area de trabajo decid&iacute; no incluirla, sin embargo si considero necesario incluir a la educaci&oacute;n media superior, dado que fue en esta en donde mi amor por las ciencias computacionales empez&oacute;.</p>

		<p>La educaci&oacute;n preparatoria la estudi&eacute; en el <b>Colegio Preparatorio de Xalapa</b>, en donde me empec&eacute; a interesar en la computaci&oacute;n. En mi primera clase de inform&aacute;tica en este colegio tuvimos la oportunidad de aprender las partes de la computadora, as&iacute; que desarmamos una, estaba tan interesado que cuando llegue a mi hogar desarme la de la casa y no la pude volver a armar, pero por suerte mi curiosidad no termino ah&iacute;. Decid&iacute; enfocarme mas en la parte l&oacute;gica de los programas cuando me d&iacute; cuenta que es&eacute; representar&iacute;a un reto. En ese entonces aprend&iacute; a usar un poco de <b>Visual Basic</b>, que solamente lo us&eacute; para hacer peque&ntilde;os programas que me ayudaban a hacer m&aacute;s r&aacute;pido mis tareas de matematicas.</p>

		<div class="image">
			<img src="images/cpx.jpg" />
			<p>Colegio preparatorio de Xalapa</p>
		</div>

		<p>En lo referente a mi educaci&oacute;n universitaria sigo cursando la carrera de ingenier&iacute;a en sistemas computacionales, en donde me encuentro ya en s&eacute;ptimo semestre, as&iacute; que se podr&iacute;a decir que ya tengo una buena cantidad de conocimientos y experiencias en esta gran instituc&iacute;&oacute;n.</p>

		<p>Para apoyar mas mi experiencia educativa tuve la oportunidad de estudiar dos meses en el extranjero, estudie dos meterias sobre videojuegos. La primera materia que estudi&eacute; fue la de dise&ntilde;o de videojuegos, en donde se cubrieron los temas a la documentaci&oacute;n y el dise&ntilde;o de que que consiste el videojuego, posteriormente la segunda materia consto sobre el desarrollo del videojuego que se dise&ntilde;o en la materia anterior.</p>
	
	</div>

	<div class="marco">
	
		<h1>Habilidades y competencias</h1>
	
		<hr />
	
		<p>Una de las habilidades que mas me agradan y que me ayudan en esta profesi&oacute;n es mi paciencia y dedicaci&oacute;n, desde peque&ntilde;o me dedique a jugar ajedrez y participe en numerosos torneos, llegando hasta estatales representando mis municipios y diferentes zonas. Aunque lamentablemente no practico actualmente esta disciplina sigo teniendo esa capacidad de estar bastante tiempo sentado pensando el la soluci&oacute;n a un problema o escribiendo lineas de c&oacute;digo, a&uacute;n as&iacute; planeo retimar esta fant&aacute;stica disciplina que de ni&ntilde;i me fascino tanto.</p>
	
		<div class="image">
			<img src="images/chess1.jpg"/>
			<p>Competencia de ajedrez en un cafe local</p>
		</div>
	
		<p>Desde que inicie la carrera en tencolog&iacute;as computacionales he trabajado mucho para poder mejorar mi experiencia y mis capacidades en diferentes ramas de la programaci&oacute;n, en lo que respecta a lenguajes de programaci&oacute;n tengo conocimientos de los siguietntes lenguajes, ordenados de manera ascendente de a cuerdo a mi nivel de experiencia en ellos</p>
	
		<ol>
			<li>C/C++</li>
			<li>C#</li>
			<li>Java</li>
			<li>Python</li>
		</ol>
	
		<p>Tambi&eacute;n cuento con experiencia en el &aacute;mbito del desarrollo web, teniendo experiencia en los siquientes temas:</p>
	
		<ul>
			<li>PHP</li>
			<li>MySQL</li>
			<li>HTML</li>
			<li>CSS</li>
			<li>Javascript</li>
		</ul>
	
		<p>Una de las competencias que considero muy importante en esta &aacute;rea es mi compromiso por la calidad, se que en un mundo donde nos encontramos con mmucha competencia es la calidad lo que nos permite diferenciarnos de la competencia.</p>
	
		<div class="video">
			<iframe src="http://www.youtube.com/embed/d1qUM16_zUE" frameborder="0" allowfullscreen></iframe>
		</div>

	</div>
	
</div>

</body>
</html>